Rahix/avr-device/vendor/attiny88.atdf
        <register caption="MCU Control Register" name="MCUCR" offset="0x55" size="1">
          <bitfield caption="BOD Sleep" mask="0x40" name="BODS"/>
          <bitfield caption="BOD Sleep Enable" mask="0x20" name="BODSE"/>
          <bitfield caption="Pull-up Disable" mask="0x10" name="PUD"/>
        </register>
        <register caption="MCU Status Register" name="MCUSR" offset="0x54" size="1">
          <bitfield caption="Watchdog Reset Flag" mask="0x08" name="WDRF"/>
          <bitfield caption="Brown-out Reset Flag" mask="0x04" name="BORF"/>
          <bitfield caption="External Reset Flag" mask="0x02" name="EXTRF"/>
          <bitfield caption="Power-on reset flag" mask="0x01" name="PORF"/>
        </register>
        <register caption="Sleep Mode Control Register" name="SMCR" offset="0x53" size="1">
          <bitfield caption="Sleep Mode" mask="0x06" name="SM" values="CPU_SLEEP_MODE_3BITS2"/>
          <bitfield caption="Sleep Enable" mask="0x01" name="SE"/>
        </register>
        <register caption="General Purpose I/O Register 2" name="GPIOR2" offset="0x4B" size="1" mask="0xFF"/>
        <register caption="General Purpose I/O Register 1" name="GPIOR1" offset="0x4A" size="1" mask="0xFF"/>
        <register caption="General Purpose I/O Register 0" name="GPIOR0" offset="0x3E" size="1" mask="0xFF"/>
        <register caption="Port Configuration Register" name="PORTCR" offset="0x32" size="1" ocd-rw="R">
          <bitfield caption="" mask="0x80" name="BBMD"/>
          <bitfield caption="" mask="0x40" name="BBMC"/>
          <bitfield caption="" mask="0x20" name="BBMB"/>
          <bitfield caption="" mask="0x10" name="BBMA"/>
          <bitfield caption="" mask="0x08" name="PUDD"/>
          <bitfield caption="" mask="0x04" name="PUDC"/>
          <bitfield caption="" mask="0x02" name="PUDB"/>
          <bitfield caption="" mask="0x01" name="PUDA"/>
        </register>
      </register-group>
      <value-group caption="" name="CPU_CLK_PRESCALE_4_BITS_SMALL">
        <value caption="1" name="VAL_0x00" value="0x00"/>
        <value caption="2" name="VAL_0x01" value="0x01"/>
        <value caption="4" name="VAL_0x02" value="0x02"/>
        <value caption="8" name="VAL_0x03" value="0x03"/>
        <value caption="16" name="VAL_0x04" value="0x04"/>
        <value caption="32" name="VAL_0x05" value="0x05"/>
        <value caption="64" name="VAL_0x06" value="0x06"/>
        <value caption="128" name="VAL_0x07" value="0x07"/>
        <value caption="256" name="VAL_0x08" value="0x08"/>
      </value-group>
      <value-group caption="" name="CPU_SLEEP_MODE_3BITS2">
        <value caption="Idle" name="IDLE" value="0x00"/>
        <value caption="ADC Noise Reduction (If Available)" name="ADC" value="0x01"/>
        <value caption="Power Down" name="PDOWN" value="0x02"/>
        <value caption="Power Save" name="PSAVE" value="0x03"/>
        <value caption="Reserved" name="VAL_0x04" value="0x04"/>
        <value caption="Reserved" name="VAL_0x05" value="0x05"/>
        <value caption="Reserved" name="VAL_0x06" value="0x06"/>
        <value caption="Reserved" name="VAL_0x07" value="0x07"/>
      </value-group>
      <value-group caption="Oscillator Calibration Values" name="OSCCAL_VALUE_ADDRESSES">
        <value value="0x00" caption="8.0 MHz" name="8_0_MHz"/>
      </value-group>
      
    </module>
    <module caption="EEPROM" name="EEPROM">
      <register-group caption="EEPROM" name="EEPROM">
        <register caption="EEPROM Address Register Low Byte" name="EEARL" offset="0x41" size="1" mask="0x3F"/>
        <register caption="EEPROM Data Register" name="EEDR" offset="0x40" size="1" mask="0xFF"/>
        <register caption="EEPROM Control Register" name="EECR" offset="0x3F" size="1">
          <bitfield caption="EEPROM Programming Mode Bits" mask="0x30" name="EEPM" values="EEP_MODE"/>
          <bitfield caption="EEPROM Ready Interrupt Enable" mask="0x08" name="EERIE"/>
          <bitfield caption="EEPROM Master Write Enable" mask="0x04" name="EEMPE"/>
          <bitfield caption="EEPROM Write Enable" mask="0x02" name="EEPE"/>
          <bitfield caption="EEPROM Read Enable" mask="0x01" name="EERE"/>
        </register>
      </register-group>
      <value-group caption="" name="EEP_MODE">
        <value caption="Erase and Write in one operation" name="VAL_0x00" value="0x00"/>
        <value caption="Erase Only" name="VAL_0x01" value="0x01"/>
        <value caption="Write Only" name="VAL_0x02" value="0x02"/>
      </value-group>
    </module>
  </modules>
  <pinouts>
    <pinout name="TQFP32_QFN32">
      <pin pad="PD3" position="1"/>
      <pin pad="PD4" position="2"/>
      <pin pad="PA2" position="3"/>
      <pin pad="VCC" position="4"/>
      <pin pad="GND" position="5"/>
      <pin pad="PA3" position="6"/>
      <pin pad="PB6" position="7"/>
      <pin pad="PB7" position="8"/>
      <pin pad="PD5" position="9"/>
      <pin pad="PD6" position="10"/>
      <pin pad="PD7" position="11"/>
      <pin pad="PB0" position="12"/>
      <pin pad="PB1" position="13"/>
      <pin pad="PB2" position="14"/>
      <pin pad="PB3" position="15"/>
      <pin pad="PB4" position="16"/>
      <pin pad="PB5" position="17"/>
      <pin pad="AVCC" position="18"/>
      <pin pad="PA0" position="19"/>
      <pin pad="PC7" position="20"/>
      <pin pad="GND" position="21"/>
      <pin pad="PA1" position="22"/>
      <pin pad="PC0" position="23"/>
      <pin pad="PC1" position="24"/>
      <pin pad="PC2" position="25"/>
      <pin pad="PC3" position="26"/>
      <pin pad="PC4" position="27"/>
      <pin pad="PC5" position="28"/>
      <pin pad="PC6" position="29"/>
      <pin pad="PD0" position="30"/>
      <pin pad="PD1" position="31"/>
      <pin pad="PD2" position="32"/>
    </pinout>
    <pinout name="PDIP">
      <pin pad="PC6" position="1"/>
      <pin pad="PD0" position="2"/>
      <pin pad="PD1" position="3"/>
      <pin pad="PD2" position="4"/>
      <pin pad="PD3" position="5"/>
      <pin pad="PD4" position="6"/>
      <pin pad="VCC" position="7"/>
      <pin pad="GND" position="8"/>
      <pin pad="PB6" position="9"/>
      <pin pad="PB7" position="10"/>
      <pin pad="PD5" position="11"/>
      <pin pad="PD6" position="12"/>
      <pin pad="PD7" position="13"/>
      <pin pad="PB0" position="14"/>
      <pin pad="PB1" position="15"/>
      <pin pad="PB2" position="16"/>
      <pin pad="PB3" position="17"/>
      <pin pad="PB4" position="18"/>
      <pin pad="PB5" position="19"/>
      <pin pad="AVCC" position="20"/>
      <pin pad="PC7" position="21"/>
      <pin pad="GND" position="22"/>
      <pin pad="PC0" position="23"/>
      <pin pad="PC1" position="24"/>
      <pin pad="PC2" position="25"/>
      <pin pad="PC3" position="26"/>
      <pin pad="PC4" position="27"/>
      <pin pad="PC5" position="28"/>
    </pinout>
    <pinout name="QFN28">
      <pin pad="PD3" position="1"/>
      <pin pad="PD4" position="2"/>
      <pin pad="VCC" position="3"/>
      <pin pad="GND" position="4"/>
      <pin pad="PB6" position="5"/>
      <pin pad="PB7" position="6"/>
      <pin pad="PD5" position="7"/>
      <pin pad="PD6" position="8"/>
      <pin pad="PD7" position="9"/>
      <pin pad="PB0" position="10"/>
      <pin pad="PB1" position="11"/>
      <pin pad="PB2" position="12"/>
      <pin pad="PB3" position="13"/>
      <pin pad="PB4" position="14"/>
      <pin pad="PB5" position="15"/>
      <pin pad="AVCC" position="16"/>
      <pin pad="PC7" position="17"/>
      <pin pad="GND" position="18"/>
      <pin pad="PC0" position="19"/>
      <pin pad="PC1" position="20"/>
      <pin pad="PC2" position="21"/>
      <pin pad="PC3" position="22"/>
      <pin pad="PC4" position="23"/>
      <pin pad="PC5" position="24"/>
      <pin pad="PC6" position="25"/>
      <pin pad="PD0" position="26"/>
      <pin pad="PD1" position="27"/>
      <pin pad="PD2" position="28"/>
    </pinout>
    <pinout name="UFBGA">
      <pin pad="PD2" position="A1"/>
      <pin pad="PD3" position="B1"/>
      <pin pad="GND" position="C1"/>
      <pin pad="VCC" position="D1"/>
      <pin pad="PB6" position="E1"/>
      <pin pad="PB7" position="F1"/>
      <pin pad="PD1" position="A2"/>
      <pin pad="PD4" position="B2"/>
      <pin pad="PA2" position="C2"/>
      <pin pad="PA3" position="D2"/>
      <pin pad="PD6" position="E2"/>
      <pin pad="PD5" position="F2"/>
      <pin pad="PC6" position="A3"/>
      <pin pad="PD0" position="B3"/>
      <pin pad="PB0" position="E3"/>
      <pin pad="PD7" position="F3"/>
      <pin pad="PC4" position="A4"/>
      <pin pad="PC5" position="B4"/>
      <pin pad="PB2" position="E4"/>
      <pin pad="PB1" position="F4"/>
      <pin pad="PC2" position="A5"/>
      <pin pad="PC3" position="B5"/>
      <pin pad="PA1" position="C5"/>
      <pin pad="PC7" position="D5"/>
      <pin pad="AVCC" position="E5"/>
      <pin pad="PB3" position="F5"/>
      <pin pad="PC1" position="A6"/>
      <pin pad="PC0" position="B6"/>
      <pin pad="GND" position="C6"/>
      <pin pad="PA0" position="D6"/>
      <pin pad="PB5" position="E6"/>
      <pin pad="PB4" position="F6"/>
    </pinout>
  </pinouts>
</avr-tools-device-file>